lijim0507/mcu_bootloader/mcu/Libraries/StdPeriphDriver/src/apm32f402_403_usb.c
/*!
 * @file        apm32f402_403_usb.c
 *
 * @brief       This file provides all the USB dirver functions
 *
 * @version     V1.0.0
 *
 * @date        2024-12-01
 *
 * @attention
 *
 *  Copyright (C) 2024-2025 Geehy Semiconductor
 *
 *  You may not use this file except in compliance with the
 *  GEEHY COPYRIGHT NOTICE (GEEHY SOFTWARE PACKAGE LICENSE).
 *
 *  The program is only for reference, which is distributed in the hope
 *  that it will be useful and instructional for customers to develop
 *  their software. Unless required by applicable law or agreed to in
 *  writing, the program is distributed on an "AS IS" BASIS, WITHOUT
 *  ANY WARRANTY OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the GEEHY SOFTWARE PACKAGE LICENSE for the governing permissions
 *  and limitations under the License.
 */

/* Includes */
#include "apm32f402_403_usb.h"

/** @addtogroup APM32F402_403_StdPeriphDriver
  @{
*/

/** @addtogroup USB_Driver USB Driver
  @{
*/

/** @defgroup USB_Functions Functions
  @{
*/

/*!
 * @brief     Pop the RxFIFO status with data
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    Rx fifo status
 */
uint32_t USB_OTG_PopRxFifoStatus(USB_OTG_GLOBAL_T* usbx)
{
    return ((uint32_t)usbx->GRXSTSP);
}

/*!
 * @brief     Config HS PHY or FS Serial Transceiver.
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @param     phy : Select PHY.
 *                    This value can be one of the following values:
 *                    @arg USB_OTG_PHY_SP_FS : FS Serial Transceiver
 *                    @arg USB_OTG_PHY_SP_HS : HS PHY
 *
 * @retval    None
 */
void USB_OTG_ConfigPHY(USB_OTG_GLOBAL_T* usbx, USB_OTG_PHY_SPEED_T phy)
{
    /* Select PHY */
    usbx->GUSBCFG_B.FSSTSEL = phy;
}

/*!
 * @brief     Read USB OTG current work mode
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    USB OTG work mode
 */
uint8_t USB_OTG_ReadMode(USB_OTG_GLOBAL_T* usbx)
{
    __IO uint8_t temp;
    temp = usbx->GCINT_B.CURMOSEL;

    return temp;
}

/*!
 * @brief     Config size of RxFifo
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @param     size : value of depth(16 - 256 words)
 *
 * @retval    None
 */
void USB_OTG_ConfigRxFifoSize(USB_OTG_GLOBAL_T* usbx, uint16_t size)
{
    usbx->GRXFIFO_B.RXFDEP = size;
}

/*!
 * @brief     Enable the specified Global interrupt
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @param     interrupt: interrupt
 *
 * @retval    None
 */
void USB_OTG_EnableGlobalInterrupt(USB_OTG_GLOBAL_T* usbx, uint32_t interrupt)
{
    usbx->GINTMASK |= (uint32_t)(interrupt);
}

/*!
 * @brief     Disable the specified Global interrupt
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @param     interrupt: interrupt
 *
 * @retval    None
 */
void USB_OTG_DisableGlobalInterrupt(USB_OTG_GLOBAL_T* usbx, uint32_t interrupt)
{
    usbx->GINTMASK &= (~(uint32_t)(interrupt));
}

/*!
 * @brief     Read USB OTG HS DMA enable status
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    None
 */
uint8_t USB_OTG_ReadDMAStatus(USB_OTG_GLOBAL_T* usbx)
{
    return (usbx->GAHBCFG_B.DMAEN);
}

/*!
 * @brief     Enable All the Global interrupt
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    None
 */
void USB_OTG_EnableAllGlobalInterrupt(USB_OTG_GLOBAL_T* usbx)
{
    usbx->GAHBCFG_B.GINTMASK = BIT_SET;
}

/*!
 * @brief     Disable All the Global interrupt
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    None
 */
void USB_OTG_DisableAllGlobalInterrupt(USB_OTG_GLOBAL_T* usbx)
{
    usbx->GAHBCFG_B.GINTMASK = BIT_RESET;
}

/*!
 * @brief     Read the specified global interrupt flag
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @param     interrupt: interrupt
 *
 * @retval    Flag status. 1 to set and 0 to not set
 */
uint8_t USB_OTG_ReadGlobalIntFlag(USB_OTG_GLOBAL_T* usbx, uint32_t interrupt)
{
    uint32_t temp;

    temp = usbx->GCINT;

    temp &= usbx->GINTMASK;

    return ((temp & (uint32_t)(interrupt)) ? SET : RESET);
}

/*!
 * @brief     Read all global interrupt flag
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    Match status
 */
uint32_t USB_OTG_ReadInterrupts(USB_OTG_GLOBAL_T* usbx)
{
    uint32_t temp;

    temp = usbx->GCINT;
    temp &= usbx->GINTMASK;

    return temp;
}

/*!
 * @brief     Clear the specified global interrupt flag(Write 1 to clear)
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @param     interrupt
 *
 * @retval    None
 */
void USB_OTG_ClearGlobalIntFlag(USB_OTG_GLOBAL_T* usbx, uint32_t interrupt)
{
    usbx->GCINT = interrupt;
}

/*!
 * @brief     Flush specific TxFIFO
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @param     num: TxFIFO number(max:16)
 *
 * @retval    None
 */
void USB_OTG_FlushTxFIFO(USB_OTG_GLOBAL_T* usbx, uint8_t num)
{
    __IO uint32_t timeout = 0;

    /* Wait for AHB master idle */
    while (usbx->GRSTCTRL_B.AHBMIDL == BIT_RESET)
    {
        if (++timeout > 0x30000)
        {
            break;
        }
    }

    usbx->GRSTCTRL_B.TXFNUM = num;
    usbx->GRSTCTRL_B.TXFFLU = BIT_SET;

    timeout = 0;
    while (usbx->GRSTCTRL_B.TXFFLU != BIT_RESET)
    {
        if (++timeout > 0x30000)
        {
            break;
        }
    }
}

/*!
 * @brief     Flush RxFIFO
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    None
 */
void USB_OTG_FlushRxFIFO(USB_OTG_GLOBAL_T* usbx)
{
    __IO uint32_t timeout = 0;

    usbx->GRSTCTRL = 0;
    usbx->GRSTCTRL_B.RXFFLU = BIT_SET;

    while (usbx->GRSTCTRL_B.RXFFLU != BIT_RESET)
    {
        if (++timeout > 0x30000)
        {
            break;
        }
    }
}

/*!
 * @brief     USB core Soft reset
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    None
 */
void USB_OTG_CoreReset(USB_OTG_GLOBAL_T* usbx)
{
    __IO uint32_t timeout = 0;

    /* Wait for AHB master idle */
    while (usbx->GRSTCTRL_B.AHBMIDL == BIT_RESET)
    {
        if (++timeout > 0x30000)
        {
            return;
        }
    }

    timeout = 0;

    usbx->GRSTCTRL_B.CSRST = BIT_SET;

    /* Wait for Reset ok */
    while (usbx->GRSTCTRL_B.CSRST != BIT_RESET)
    {
        if (++timeout > 0x30000)
        {
            return;
        }
    }
}

/*!
 * @brief     Enable power down.
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    None
 */
void USB_OTG_EnablePowerDown(USB_OTG_GLOBAL_T* usbx)
{
    usbx->GGCCFG_B.PWEN = BIT_RESET;
}

/*!
 * @brief     Disable power down.
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    None
 */
void USB_OTG_DisablePowerDown(USB_OTG_GLOBAL_T* usbx)
{
    usbx->GGCCFG_B.PWEN = BIT_SET;
}

/*!
 * @brief     Enable USB OTG DMA
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @retval    None
 *
 * @note      Available only in HS mode
 */
void USB_OTG_EnableDMA(USB_OTG_GLOBAL_T* usbx)
{
    usbx->GAHBCFG_B.DMAEN = BIT_SET;
}

/*!
 * @brief     Set USB OTG burst length
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @param     burstType: Select the burst type
 *
 * @retval    None
 *
 * @note      Available only in HS mode
 */
void USB_OTG_SetBurstLenght(USB_OTG_GLOBAL_T* usbx, USB_OTG_BURST_T burstType)
{
    usbx->GAHBCFG_B.BLT = burstType;
}

/*!
 * @brief     Configure turnaround time
 *
 * @param     usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @param     hclkFreq: HCLK frequency
 *
 * @param     speed: device speed
 *
 * @retval    None
 */
void USB_OTG_SetTurnaroundTime(USB_OTG_GLOBAL_T* usbx, uint32_t hclkFreq, uint8_t speed)
{
    uint8_t turnaroundTime;
    uint32_t hclkFreqTemp = (uint32_t)hclkFreq / 100000;

    switch (speed)
    {
        case USB_OTG_SPEED_HSFSLS:
            turnaroundTime = USBD_HS_TRDT_VAL;
            break;

        case USB_OTG_SPEED_FSLS:
            if ((hclkFreqTemp >= 142) && (hclkFreqTemp < 150))
            {
                turnaroundTime = 0x0F;
            }
            else if ((hclkFreqTemp >= 150) && (hclkFreqTemp < 160))
            {
                turnaroundTime = 0x0E;
            }
            else if ((hclkFreqTemp >= 160) && (hclkFreqTemp < 172))
            {
                turnaroundTime = 0x0D;
            }
            else if ((hclkFreqTemp >= 172) && (hclkFreqTemp < 185))
            {
                turnaroundTime = 0x0C;
            }
            else if ((hclkFreqTemp >= 185) && (hclkFreqTemp < 200))
            {
                turnaroundTime = 0x0B;
            }
            else if ((hclkFreqTemp >= 200) && (hclkFreqTemp < 218))
            {
                turnaroundTime = 0x0A;
            }
            else if ((hclkFreqTemp >= 218) && (hclkFreqTemp < 240))
            {
                turnaroundTime = 0x09;
            }
            else if ((hclkFreqTemp >= 240) && (hclkFreqTemp < 277))
            {
                turnaroundTime = 0x08;
            }
            else if ((hclkFreqTemp >= 277) && (hclkFreqTemp < 320))
            {
                turnaroundTime = 0x07;
            }
            else
            {
                turnaroundTime = 0x06;
            }
            break;

        default:
            turnaroundTime = USBD_DEFAULT_TRDT_VAL;
            break;
    }

