lijim0507/mcu_bootloader/mcu/Libraries/StdPeriphDriver/src/apm32f402_403_usb.c
    usbx->GUSBCFG_B.TRTIM = (turnaroundTime) & 0x0F;
}

/*!
 * @brief       Force USB to device ot host mode.
 *
 * @param       usbx: Select the USB port.
 *              @arg USB_OTG_FS
 *              @arg USB_OTG_HS
 *
 * @param       mode : Select mode.
 *                    This value can be one of the following values:
 *                    @arg USB_OTG_MODE_DEVICE : Force device mode.
 *                    @arg USB_OTG_MODE_HOST   : Force host mode.
 *
 * @retval      None
 */
void USB_OTG_ConfigMode(USB_OTG_GLOBAL_T* usbx, USB_OTG_MODE_T mode)
{
    uint32_t timeout = 0;

    usbx->GUSBCFG_B.FHMODE = BIT_RESET;
    usbx->GUSBCFG_B.FDMODE = BIT_RESET;

    if (mode == USB_OTG_MODE_HOST)
    {
        usbx->GUSBCFG_B.FHMODE = BIT_SET;

        while (USB_OTG_ReadMode(usbx) != USB_OTG_MODE_HOST)
        {
            timeout++;

            if (timeout >= 0xFFFFFFF)
            {
                break;
            }
        }
    }
    else
    {
        usbx->GUSBCFG_B.FDMODE = BIT_SET;

        while (USB_OTG_ReadMode(usbx) != USB_OTG_MODE_DEVICE)
        {
            timeout++;

            if (timeout >= 0xFFFFFFF)
            {
                break;
            }
        }
    }
}

/*!
 * @brief     Enable port power
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    None
 */
void USB_OTG_H_EnablePortPower(USB_OTG_HOST_T* usbhx)
{
    usbhx->HPORTCSTS_B.PP = BIT_SET;
}

/*!
 * @brief     Disable port power
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    None
 */
void USB_OTG_H_DisablePortPower(USB_OTG_HOST_T* usbhx)
{
    usbhx->HPORTCSTS_B.PP = BIT_RESET;
}

/*!
 * @brief     Enable low speed device
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum:  channel number
 *
 * @retval    None
 */
void USB_OTG_H_EnableLowSpeedDevice(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    usbhx->REGS_HCH[chNum].HCH_B.LSDV = BIT_SET;
}

/*!
 * @brief     Disable low speed device
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum:  channel number
 *
 * @retval    None
 */
void USB_OTG_H_DisableLowSpeedDevice(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    usbhx->REGS_HCH[chNum].HCH_B.LSDV = BIT_RESET;
}

/*!
 * @brief     Set host channel device address
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum:  channel number
 *
 * @param     devAddr: device address
 *
 * @retval    None
 */
void USB_OTG_H_ConfigDeviceAddr(USB_OTG_HOST_T* usbhx, uint8_t chNum, uint8_t devAddr)
{
    usbhx->REGS_HCH[chNum].HCH_B.DVADDR = (devAddr & 0x7F);
}

/*!
 * @brief     Set host channel endpoint type
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum:  channel number
 *
 * @param     epType: endpoint type
 *              @arg EP_TYPE_CONTROL
 *              @arg EP_TYPE_ISO
 *              @arg EP_TYPE_BULK
 *              @arg EP_TYPE_INTERRUPT
 *
 * @retval    None
 */
void USB_OTG_H_ConfigEpType(USB_OTG_HOST_T* usbhx, uint8_t chNum, uint8_t epType)
{
    usbhx->REGS_HCH[chNum].HCH_B.EDPTYP = (epType & 0x03);
}

/*!
 * @brief     Set host channel packet max size
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum:  channel number
 *
 * @param     packetMaxSize: packet data max size
 *
 * @retval    None
 */
void USB_OTG_H_ConfigEpMaxPSize(USB_OTG_HOST_T* usbhx, uint8_t chNum, uint16_t packetMaxSize)
{
    usbhx->REGS_HCH[chNum].HCH_B.MAXPSIZE = (packetMaxSize & 0x7FF);
}

/*!
 * @brief     Set host channel endpoint number
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum:  channel number
 *
 * @param     epNum:  endpoint number
 *
 * @retval    None
 */
void USB_OTG_H_ConfigEpNum(USB_OTG_HOST_T* usbhx, uint8_t chNum, uint8_t epNum)
{
    usbhx->REGS_HCH[chNum].HCH_B.EDPNUM = (epNum & 0x7F);
}

/*!
 * @brief     Use odd frame to transfer
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum: channel number
 *
 * @retval    None
 */
void USB_OTG_H_TxUseOddFrame(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    usbhx->REGS_HCH[chNum].HCH_B.ODDF = BIT_SET;
}

/*!
 * @brief     Use even frame to transfer
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum:  channel number
 *
 * @retval    None
 */
void USB_OTG_H_TxUseEvenFrame(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    usbhx->REGS_HCH[chNum].HCH_B.ODDF = BIT_RESET;
}

/*!
 * @brief     USB host driver VBUS status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     state: Select the USB port power status
 *              @arg USBH_PORT_PWR_OFF
 *              @arg USBH_PORT_PWR_ON
 *
 * @retval    None
 *
 */
void USB_OTG_H_DriverVbus(USB_OTG_HOST_T* usbhx, USBH_PORT_PWR_STA_T state)
{
    if (state == USBH_PORT_PWR_ON)
    {
        if (usbhx->HPORTCSTS_B.PP == RESET)
        {
            USB_OTG_H_EnablePortPower(usbhx);
        }
    }
    else
    {
        if (usbhx->HPORTCSTS_B.PP == SET)
        {
            USB_OTG_H_DisablePortPower(usbhx);
        }
    }
}

/*!
 * @brief     Enable channel
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum:  channel number
 *
 * @retval    None
 */
void USB_OTG_H_EnableChannel(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    usbhx->REGS_HCH[chNum].HCH_B.CHINT = BIT_RESET;

    usbhx->REGS_HCH[chNum].HCH_B.CHEN = BIT_SET;
}

/*!
 * @brief     Read Periodic Transmit Request Queue Available Space
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    spave value
 */
uint32_t USB_OTG_H_ReadTxQueueRemainSpace(USB_OTG_HOST_T* usbhx)
{
    return (usbhx->HPTXSTS_B.QSPACE);
}

/*!
 * @brief     Read packet count
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum:  channel number
 *
 * @retval    packet count
 */
uint32_t USB_OTG_H_ReadPacketCount(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    return (usbhx->REGS_HCH[chNum].HCHTSIZE_B.PCKTCNT);
}

/*!
 * @brief     Read all channel interrupt flag
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     channel: channel
 *
 * @retval    channel interrupt status
 */
uint32_t USB_OTG_H_ReadAllChannelsIntFlag(USB_OTG_HOST_T* usbhx, uint16_t channel)
{
    uint32_t temp = 0;

    temp = usbhx->HACHINT;

