lijim0507/mcu_bootloader/mcu/Libraries/StdPeriphDriver/src/apm32f402_403_usb.c
    temp &= usbhx->HACHIMASK;

    return (((temp) & (uint32_t)(channel)) ? SET : RESET);
}

/*!
 * @brief     Read host port speed
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    Port speed
 */
uint8_t USB_OTG_H_ReadPortSpeedType(USB_OTG_HOST_T* usbhx)
{
    return (usbhx->HPORTCSTS_B.PSPDSEL);
}

/*!
 * @brief     Read host port POVC change status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    Port POVC change status
 */
uint8_t USB_OTG_H_PovcBitIsChange(USB_OTG_HOST_T* usbhx)
{
    return ((usbhx->HPORTCSTS_B.POVCCHG) ? SET : RESET);
}

/*!
 * @brief     Clear host port POVC change status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    None
 */
void USB_OTG_H_ClearPovcBitChangeFlag(USB_OTG_HOST_T* usbhx)
{
    usbhx->HPORTCSTS_B.POVCCHG = BIT_SET;
}

/*!
 * @brief     Read host port connect status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    Connect status
 */
uint8_t USB_OTG_H_PortIsConnect(USB_OTG_HOST_T* usbhx)
{
    return ((usbhx->HPORTCSTS_B.PCNNTFLG) ? SET : RESET);
}

/*!
 * @brief     Read host port PEN change status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    Bit change status
 */
uint8_t USB_OTG_H_PenBitIsChange(USB_OTG_HOST_T* usbhx)
{
    return ((usbhx->HPORTCSTS_B.PENCHG) ? SET : RESET);
}

/*!
 * @brief     Clear host port PEN change status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    None
 */
void USB_OTG_H_ClearPenBitChangeFlag(USB_OTG_HOST_T* usbhx)
{
    usbhx->HPORTCSTS_B.PENCHG = BIT_SET;
}

/*!
 * @brief     Read host port enable status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    Port enable status
 */
uint8_t USB_OTG_H_PortIsEnable(USB_OTG_HOST_T* usbhx)
{
    return ((usbhx->HPORTCSTS_B.PEN) ? SET : RESET);
}

/*!
 * @brief     Read host endpoint direction
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    Endpoint direction
 */
uint8_t USB_OTG_H_ReadEpDirection(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    return (usbhx->REGS_HCH[chNum].HCH_B.EDPDRT);
}

/*!
 * @brief     Configure host phy clock
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     phyClock: Select the USB phy clock
 *              @arg PHYCLK_30_60_MHZ
 *              @arg PHYCLK_48_MHZ
 *              @arg PHYCLK_6_MHZ
 *
 * @retval    None
 */
void USB_OTG_H_ConfigHostClk(USB_OTG_HOST_T* usbhx, USBH_PHYCLK_T phyClock)
{
    usbhx->HCFG_B.PHYCLKSEL = (phyClock & 0x03);
}

/*!
 * @brief     Set frame interval value
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     freq: Frequency
 *
 * @retval    None
 */
void USB_OTG_H_SetFrameInterval(USB_OTG_HOST_T* usbhx, uint16_t freq)
{
    usbhx->HFIVL_B.FIVL = (freq & 0xFFFF);
}

/*!
 * @brief     Set channel transfer size
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum: channel number
 *
 * @param     size: transfer size(0 ~ 0x7FFF)
 *
 * @retval    None
 */
void USB_OTG_H_ConfigTransferSize(USB_OTG_HOST_T* usbhx, uint8_t chNum, uint32_t size)
{
    usbhx->REGS_HCH[chNum].HCHTSIZE_B.TSFSIZE = size & 0x7FFFF;
}

/*!
 * @brief     Set channel transfer packet count
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum: channel number
 *
 * @param     count: packet count(0 ~ 0x3FF)
 *
 * @retval    None
 */
void USB_OTG_H_ConfigPacketCount(USB_OTG_HOST_T* usbhx, uint8_t chNum, uint32_t count)
{
    usbhx->REGS_HCH[chNum].HCHTSIZE_B.PCKTCNT = count & 0x3FF;
}

/*!
 * @brief     Set channel transfer data PID
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum: channel number
 *
 * @param     pid: data pid
 *
 * @retval    None
 */
void USB_OTG_H_ConfigDataPID(USB_OTG_HOST_T* usbhx, uint8_t chNum, USB_OTG_DATA_PID_T pid)
{
    usbhx->REGS_HCH[chNum].HCHTSIZE_B.DATAPID = pid;
}

/*!
 * @brief     Set channel transfer DMA address
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum: channel number
 *
 * @param     addr: DMA address
 *
 * @retval    None
 */
void USB_OTG_H_ConfigDMAAddr(USB_OTG_HOST_T* usbhx, uint8_t chNum, uint32_t addr)
{
    usbhx->REGS_HCH[chNum].HCHDMA = addr;
}

/*!
 * @brief     Read host frame number
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @retval    frame number
 */
uint16_t USB_OTG_H_ReadFrameNum(USB_OTG_HOST_T* usbhx)
{
    return (usbhx->HFIFM_B.FNUM);
}

/*!
 * @brief     Read host endpoint type
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum: channel number
 *
 * @retval    endpoint type
 */
uint8_t USB_OTG_H_ReadEpType(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    return (usbhx->REGS_HCH[chNum].HCH_B.EDPTYP);
}

/*!
 * @brief     Read usb host transfer size
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum: channel number
 *
 * @retval    transfer size
 */
uint32_t USB_OTG_H_ReadTransferSize(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    return (usbhx->REGS_HCH[chNum].HCHTSIZE_B.TSFSIZE);
}

/*!
 * @brief     Read channel enable status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     chNum: channel number
 *
 * @retval    channel enable status
 */
uint8_t USB_OTG_H_ReadChannelStatus(USB_OTG_HOST_T* usbhx, uint8_t chNum)
{
    return (usbhx->REGS_HCH[chNum].HCH_B.CHEN);
}

/*!
 * @brief     Read channel interrrupt status
 *
 * @param     usbhx: Select the USB host port.
 *              @arg USB_OTG_FS_H
 *              @arg USB_OTG_HS_H
 *
 * @param     interrrupt: channel interrrupt
 *              @arg CHANNEL_INT_TSFCMPN
 *              @arg CHANNEL_INT_TSFCMPAN
 *              @arg CHANNEL_INT_AHBERR
 *              @arg CHANNEL_INT_RXSTALL
 *              @arg CHANNEL_INT_RXNAK
 *              @arg CHANNEL_INT_RXTXACK
 *              @arg CHANNEL_INT_RXNYET
 *              @arg CHANNEL_INT_TERR
 *              @arg CHANNEL_INT_BABBLE
 *              @arg CHANNEL_INT_FOVR
 *              @arg CHANNEL_INT_DTOG
 *              @arg CHANNEL_INT_ALL
 *
 * @retval    interrupt status
 */
uint8_t USB_OTG_H_ReadChannelIntFlag(USB_OTG_HOST_T* usbhx, uint8_t chNum, uint32_t interrupt)
{
    uint32_t temp;

    temp = (usbhx->REGS_HCH[chNum].HCHINT);

    temp &= usbhx->REGS_HCH[chNum].HCHIMASK;

